{
  "events": [],
  "raw_text": "Visa\nNew Grad Software Engineer\nInterview Sheet\nProgramming Questions\n*Note: You are required to write the complete code of the problem and then discuss the\napproach and time/space complexity.\n1. Print all the palindromic sub-strings in the given string.\n2. How will you implement Queue using two Stacks.\n3. Find if a given tree is a binary search tree or not.\n4. Inorder/Preorder/Postorder traversal of a binary tree using recursion.\n5. Check if a string of parentheses is valid without using a stack.\n6. Given an integer array, find the nth largest number in the array.\n7. Print level order traversal of a binary tree with alternate levels reversed.\nTechnical Questions\n*Major focus areas include – Concepts of DBMS, OS, CN, Java\n1. What is the difference between a process and a thread?\n2. Types of databases, and give two examples of each.\n3. ACID properties and explain them.\n4. What are different normalisations, and explain each with examples?\n5. Explain the layers and their functionalities of the OSI model.\n6. What are the advantages and disadvantages of cloud computing?\n7. Differences between Java and Python.\n8. OOP Concepts with real-life examples.\n9. What is Translation Lookaside Buffer (TLB)? Consequences of not using it?\n10. Which operating system do you use? Describe its kernel type.\n11. Difference between monolithic and microservices architecture; when to use\nmonolithic?\n12. Explain the OS booting process.\n13. Explain SDLC and STLC.\n14. What are virtual functions?\n15. Explain the diamond problem in JAVA.\n16. Difference between primary key and foreign key.\n17. Explain multiprocessing, multitasking, and multiprogramming.\n18. Types of schedulers in OS; which is most important?\n19. How can you ensure data integrity in file system design?\n20. What are the steps involved when a client sends data to a server?\nHR/ Managerial Round Question\n1. What are your thoughts about advancing to this round and how has been your day so\nfar?\n2. What are some latest technology trends that have fascinated you and what are\npotential improvements you would like to bring in those areas?\n3. Can you envision improvements in online payment systems like Paytm and Google\nPay?\n4. Have you ever used flask? What are some of its advantages and disadvantages?\n5. How will you design your own hashing algorithm?\n6. What are your strengths and weaknesses?\n7. What is cloud computing? Its advantages and disadvantages."
}